Revit 2015 API
AreaReinforcement.Create Method (Document, Element, IList<Curve>, XYZ)
 Creates a new AreaReinforcement object from an array of curves.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2014
Syntax
C#
[ObsoleteAttribute("This method is obsolete in Revit 2015. Use the Create() method that accepts additional arguments (the id of the AreaReinforcementType, RebarBarType, and RebarHookType).")]
public static AreaReinforcement Create(
	Document document,
	Element hostElement,
	IList<Curve> curveArray,
	XYZ majorDirection
)
Visual Basic
<ObsoleteAttribute("This method is obsolete in Revit 2015. Use the Create() method that accepts additional arguments (the id of the AreaReinforcementType, RebarBarType, and RebarHookType).")> _
Public Shared Function Create ( _
	document As Document, _
	hostElement As Element, _
	curveArray As IList(Of Curve), _
	majorDirection As XYZ _
) As AreaReinforcement
Visual C++
[ObsoleteAttribute(L"This method is obsolete in Revit 2015. Use the Create() method that accepts additional arguments (the id of the AreaReinforcementType, RebarBarType, and RebarHookType).")]
public:
static AreaReinforcement^ Create(
	Document^ document,
	Element^ hostElement,
	IList<Curve^>^ curveArray,
	XYZ^ majorDirection
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document.
hostElement
Type: Autodesk.Revit.DB.Element
 The element that will host the AreaReinforcement. The host can be either a Structural Floor or Structural Wall.
curveArray
Type: System.Collections.Generic.IList<Curve>
 An array of curves that will define the outline of the AreaReinforcement.
majorDirection
Type: Autodesk.Revit.DB.XYZ
 A vector to define the major direction of the AreaReinforcement.
Return Value
 The newly created AreaReinforcement.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The input curveArray is empty. -or- The input curveArray contains at least one helical curve and is not supported for this operation. -or- The document document does not contain the element hostElement -or- the host Element is not a valid host for Area Reinforcement, Path Reinforcement, Fabric Area or Fabric Sheet. -or- Curves in curveArray are not closed and continuous.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  majorDirection has zero length.
Autodesk.Revit.Exceptions.DisabledDisciplineException |  None of the following disciplines is enabled: Structural.
Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException |  This method may not be called during dynamic update.
See Also
AreaReinforcement Class
Create Overload
Autodesk.Revit.DB.Structure Namespace